## staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| add    | `aws_iam_role.database`                                  |
|        | `aws_iam_role_policy_attachment.database_worker`         |
|        | `aws_iam_role_policy_attachment.parameters_csi_database` |
|        | `aws_iam_role_policy_attachment.secrets_csi_database`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
18:58:16.171 STDOUT terraform:   + create
18:58:16.171 STDOUT terraform: Terraform will perform the following actions:
18:58:16.171 STDOUT terraform:   # aws_iam_role.database will be created
18:58:16.171 STDOUT terraform:   + resource "aws_iam_role" "database" {
18:58:16.171 STDOUT terraform:       + arn                   = (known after apply)
18:58:16.171 STDOUT terraform:       + assume_role_policy    = jsonencode(
18:58:16.171 STDOUT terraform:             {
18:58:16.171 STDOUT terraform:               + Statement = [
18:58:16.171 STDOUT terraform:                   + {
18:58:16.171 STDOUT terraform:                       + Action    = "sts:AssumeRoleWithWebIdentity"
18:58:16.171 STDOUT terraform:                       + Condition = {
18:58:16.171 STDOUT terraform:                           + StringEquals = {
18:58:16.171 STDOUT terraform:                               + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
18:58:16.172 STDOUT terraform:                               + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:notification-canada-ca:notify-database"
18:58:16.172 STDOUT terraform:                             }
18:58:16.172 STDOUT terraform:                         }
18:58:16.172 STDOUT terraform:                       + Effect    = "Allow"
18:58:16.172 STDOUT terraform:                       + Principal = {
18:58:16.172 STDOUT terraform:                           + Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
18:58:16.172 STDOUT terraform:                         }
18:58:16.172 STDOUT terraform:                     },
18:58:16.172 STDOUT terraform:                 ]
18:58:16.172 STDOUT terraform:               + Version   = "2012-10-17"
18:58:16.172 STDOUT terraform:             }
18:58:16.172 STDOUT terraform:         )
18:58:16.172 STDOUT terraform:       + create_date           = (known after apply)
18:58:16.172 STDOUT terraform:       + force_detach_policies = false
18:58:16.172 STDOUT terraform:       + id                    = (known after apply)
18:58:16.172 STDOUT terraform:       + managed_policy_arns   = (known after apply)
18:58:16.172 STDOUT terraform:       + max_session_duration  = 3600
18:58:16.172 STDOUT terraform:       + name                  = "secrets-csi-role-database"
18:58:16.172 STDOUT terraform:       + name_prefix           = (known after apply)
18:58:16.172 STDOUT terraform:       + path                  = "/"
18:58:16.172 STDOUT terraform:       + tags_all              = (known after apply)
18:58:16.172 STDOUT terraform:       + unique_id             = (known after apply)
18:58:16.172 STDOUT terraform:       + inline_policy (known after apply)
18:58:16.172 STDOUT terraform:     }
18:58:16.172 STDOUT terraform:   # aws_iam_role_policy_attachment.database_worker will be created
18:58:16.172 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "database_worker" {
18:58:16.172 STDOUT terraform:       + id         = (known after apply)
18:58:16.173 STDOUT terraform:       + policy_arn = "arn:aws:iam::239043911459:policy/notification-worker-policy"
18:58:16.173 STDOUT terraform:       + role       = "secrets-csi-role-database"
18:58:16.173 STDOUT terraform:     }
18:58:16.173 STDOUT terraform:   # aws_iam_role_policy_attachment.parameters_csi_database will be created
18:58:16.173 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "parameters_csi_database" {
18:58:16.173 STDOUT terraform:       + id         = (known after apply)
18:58:16.173 STDOUT terraform:       + policy_arn = "arn:aws:iam::239043911459:policy/parameters-csi-policy"
18:58:16.173 STDOUT terraform:       + role       = "secrets-csi-role-database"
18:58:16.173 STDOUT terraform:     }
18:58:16.173 STDOUT terraform:   # aws_iam_role_policy_attachment.secrets_csi_database will be created
18:58:16.173 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "secrets_csi_database" {
18:58:16.173 STDOUT terraform:       + id         = (known after apply)
18:58:16.173 STDOUT terraform:       + policy_arn = "arn:aws:iam::239043911459:policy/secrets-csi-policy"
18:58:16.173 STDOUT terraform:       + role       = "secrets-csi-role-database"
18:58:16.173 STDOUT terraform:     }
18:58:16.173 STDOUT terraform: Plan: 4 to add, 0 to change, 0 to destroy.
18:58:16.173 STDOUT terraform: Warning: Deprecated attribute
18:58:16.173 STDOUT terraform:   on .terraform/modules/sentinel_forwarder/sentinel_forwarder/main.tf line 85, in resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription":
18:58:16.173 STDOUT terraform:   85:   principal     = "logs.${data.aws_region.current.name}.amazonaws.com"
18:58:16.173 STDOUT terraform: The attribute "name" is deprecated. Refer to the provider documentation for
18:58:16.173 STDOUT terraform: details.
18:58:16.173 STDOUT terraform: (and 3 more similar warnings elsewhere)
18:58:16.174 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
18:58:16.174 STDOUT terraform: Saved the plan to: plan.tfplan
18:58:16.174 STDOUT terraform: To perform exactly these actions, run the following command to apply:
18:58:16.174 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
